{
  "Groups": [
    {
      "Name": "mainTweaks",
      "DisplayName": "Main Tweaks",
      "Elements": [
        {
          "Name": "momentum",
          "DisplayName": "Momentum",
          "Description": [
            "Allows Sonic to gain, lose, and retain speed naturally.\n",
            "Sonic's air drag has been reduced when he's falling uncurled, allowing him to keep his forward momentum in the air better.\n",
            "Sonic's jump speed limit has been increased, allowing incline jumps to be easier to perform."
          ],
          "Type": "bool",
          "DefaultValue": true
        },
        {
          "Name": "chargableSpinDash",
          "DisplayName": "Chargable Spin Dash",
          "Description": [
            "RECOMMENDED: Enable the 'Disable Drop Dash' code in HMM.\n",
            "Enables spin charging to determine the spin dash speed. 5 charges = max dash speed.\n",
            "Due to the charge requirement to dash, holding the spin dash button without charging makes the ability act like a roll in the classic games.\n",
            "Charging in the air no longer kills Sonic's prior momentum. This makes it act like a normal drop dash, and makes it the recommended way to perform it.\n",
            "If momentum is enabled, the spin dash will be momentum-based and the max speed will depend on if power boost is active.\n",
            "Else, it'll act like the vanilla spin dash, but with charging taken into account."
          ],
          "Type": "bool",
          "DefaultValue": true
        },
        {
          "Name": "balancedDrain",
          "DisplayName": "Balanced Boost Gauge Drain",
          "Description": [
            "RECOMMENDED: Use if momentum is enabled.\n",
            "Re-balances the boost to account for Sonic's ability to retain speed very well.\n",
            "The boost lasts much shorter, making it act more like a dash ability. The spin dash, however, lasts much longer.\n",
            "Infinite boost now lasts for 2 minutes instead of 3. It's recommended to activate infinite boost when facing SQUID."
          ],
          "Type": "bool",
          "DefaultValue": true
        },
        {
          "Name": "csAirBoost",
          "DisplayName": "Cyber Space Air Boost",
          "Description": [
            "Enables Cyber Space air boost physics (the only good thing about those physics IMO).\n",
            "This air boost is momentum-based in a way? The faster Sonic was before air boosting, the longer the air boost lasts.\n",
            "Additionally, Sonic doesn't descend while air boosting, so it sorta mimicks Unleashed's air boost."
          ],
          "Type": "bool",
          "DefaultValue": true
        },
        {
          "Name": "softRingDash",
          "DisplayName": "Soft Ring Dash Brake",
          "Description": [
            "Prevents Sonic from coming to a halt after ring dashing."
          ],
          "Type": "bool",
          "DefaultValue": true
        },
        {
          "Name": "railMomentum",
          "DisplayName": "Rail Momentum",
          "Description": [
            "Decreases rail deceleration, allowing Sonic to gain, lose, and retain speed naturally while grinding.\n",
            "Sonic still has a minimum grinding speed, but it has been reduced."
          ],
          "Type": "bool",
          "DefaultValue": true
        }
      ]
    },
    {
      "Name": "optionalTweaks",
      "DisplayName": "Optional Tweaks",
      "Elements": [
        {
          "Name": "fasterRunning",
          "DisplayName": "Faster Base Running Speed",
          "Description": ["Makes running without boost less painful."],
          "Type": "bool",
          "DefaultValue": false
        },
        {
          "Name": "harderParry",
          "DisplayName": "Harder Parry",
          "Description": [
            "The parry now lasts 0.3s instead of 15s, incentivizing players to time their parries well.\n",
            "The length is subject to change; I haven't tested this in boss fights yet."
          ],
          "Type": "bool",
          "DefaultValue": false
        },
        {
          "Name": "minSlide",
          "DisplayName": "Decreased Minimum Slide Speed",
          "Description": [
            "Decreases the minimum speed for sliding.\n",
            "I don't like the random speed-up from sliding, so this fixes it."
          ],
          "Type": "bool",
          "DefaultValue": false
        },
        {
          "Name": "softWallBrake",
          "DisplayName": "Soft Wall Running Brake",
          "Description": [
            "Prevents Sonic from coming to an instant stop when letting go of the boost button while wall running.\n"
          ],
          "Type": "bool",
          "DefaultValue": false
        }
      ]
    },
    {
      "Name": "experimentalTweaks",
      "DisplayName": "Experimental Tweaks",
      "Elements": [
        {
          "Name": "slamDemand",
          "DisplayName": "Grand Slam On Demand",
          "Description": [
            "Activate Grand Slam after a homing attack, a melee attack, or a quick cyloop by pressing Y and B together.\n",
            "Heavily experimental. If anyone knows anything about button remapping or anything related to combat modding, pls reach out in DMs!"
          ],
          "Type": "bool",
          "DefaultValue": false
        }
      ]
    }
  ],
  "IniFile": "config.ini"
}
